title: Potential CobaltStrike jump-winrm usage
id: 315f165d-92fd-170d-d80b-0f16f9cf538446
status: test
description: Detects possible CobaltStrike jump-winrm module usage
author: Krzysztof Kuzin
date: 2025-09-17
tags:
    - attack.execution
    - detection.threat-hunting
logsource:
    product: windows
    category: ps_classic_start
detection:
    ps_classic_start:
        EventID: 600
        Channel: Windows PowerShell
    selection:
        Data|contains|all:
        - -NoLogo
        - -NoProfile
        - -s
        - ServerRemoteHost
        - -Version
    condition: selection
falsepositives:
    - unknown
level: medium
ruletype: Sigma
